"""
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""
# a = 97
symbol_num = int(input('Введите номер буквы в алфавите a-z '))
print(f'Буква с кодом {symbol_num}  это {chr(symbol_num)}')
