"""
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
https://drive.google.com/file/d/1Ui2yipbPwl4C9ZbY4KEk6VSmB2YBMh-k/view?usp=sharing
"""

symbol_num = int(input('Введите номер буквы в алфавите a-z '))
print(f'Буква с кодом {symbol_num}  это {chr(symbol_num)}')
